app/controllers/restaurants_controller.rb

	def create
		@restaurant = current_user.restaurants.new(restaurant_params)
		@restaurant.user_id = current_user.id
		if @restaurant.save
---
INSERT INTO "restaurants" ("created_at", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-11-19 13:45:12.954624"], ["name", "KFC"], ["updated_at", "2014-11-19 13:45:12.954624"], ["user_id", 92]]

	def edit
		@restaurant = current_user.restaurants.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."user_id" = $1 AND "restaurants"."id" = $2 LIMIT 1  [["user_id", 3], ["id", 5]]

	def update
		@restaurant = current_user.restaurants.find(params[:id])
		@restaurant.update(restaurant_params)
---
SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."user_id" = $1 AND "restaurants"."id" = $2 LIMIT 1  [["user_id", 3], ["id", 5]]
UPDATE "restaurants" SET "name" = $1, "updated_at" = $2 WHERE "restaurants"."id" = 1  [["name", "KFC12389123"], ["updated_at", "2014-11-03 14:37:54.616082"]]

	def destroy
		@restaurant = current_user.restaurants.find(params[:id])
		@restaurant.destroy
---
SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."user_id" = $1 AND "restaurants"."id" = $2 LIMIT 1  [["user_id", 4], ["id", 6]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 115]]