app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "reviews" ("created_at", "rating", "restaurant_id", "thoughts", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-11-04 11:53:58.471525"], ["rating", 3], ["restaurant_id", 3], ["thoughts", "So so"], ["updated_at", "2014-11-04 11:53:58.471525"]]
UPDATE "reviews" SET "updated_at" = $1, "user_id" = $2 WHERE "reviews"."id" = 5  [["updated_at", "2014-11-19 14:26:43.373601"], ["user_id", 3]]
---
	def create
		@restaurant = Restaurant.find(params[:restaurant_id])
		@review = @restaurant.reviews.create(review_params)
		@review.user = current_user
		if @review.save

SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 6]]
---
	def destroy
		@review = Review.find(params[:id])
		@review.destroy